Autodesk.Revit.DB.ViewNode.GetCameraInfo
Information about the observation point (the camera) of the view.
Returns:
An instance of CameraInfo or null if there is no info associated with the view
Since:
2014

Autodesk.Revit.DB.ViewNode.ViewId
The Id of the view element.
Since:
2014

Autodesk.Revit.DB.ViewNode.LevelOfDetail
The level of detail the view is going to be rendered at.
Remarks:
The value is an integer number in range of [0,15] (inclusive),
or a value {-1}. If the value is positive, Revit will use the
suggested level of detail when tessellating faces; otherwise it will
use its default algorithm, which is based on output resolution.
If an explicit level of detail is requested (i.e. a positive value),
using a value close to the middle of the valid range yields a very
reasonable tessellation. Revit uses level 8 as its 'normal' LoD.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The level of detail is not in valid range.
It must be a number between -1 and 15, all inclusive.
Since:
2014

Autodesk.Revit.DB.ViewNode
A render node that represents a view.
Remarks:
See also: Autodesk::Revit::DB::IExportContext::OnViewBegin.
Since:
2014